import type { BlogPost } from './types';

export const BLOG_POSTS: BlogPost[] = [
	{
		slug: 'first-news',
		title: 'Первая новость SkeletonHub',
		excerpt: 'Короткое описание новости, которое будет видно на карточке.',
		date: '2026-02-09',
		content: ['Это полный текст новости (абзац 1).', 'Это полный текст новости (абзац 2).'],
	},

	{
		slug: 'data-fetching',
		title: 'Первая новость SkeletonHub',
		excerpt: 'Короткое описание новости, которое будет видно на карточке.',
		date: '2026-02-08',
		content: ['Это полный текст новости (абзац 1).', 'Это полный текст новости (абзац 2).'],
	},

	{
		slug: 'server-actions',
		title: 'Первая новость SkeletonHub',
		excerpt: 'Короткое описание новости, которое будет видно на карточке.',
		date: '2026-02-06',
		content: ['Это полный текст новости (абзац 1).', 'Это полный текст новости (абзац 2).'],
	},

	{
		slug: 'route-handlers',
		title: 'Первая новость SkeletonHub',
		excerpt: 'Короткое описание новости, которое будет видно на карточке.',
		date: '2026-02-03',
		content: ['Это полный текст новости (абзац 1).', 'Это полный текст новости (абзац 2).'],
	},

	{
		slug: 'wweeeeeeeeeeee',
		title: 'Первая новость SkeletonHub',
		excerpt: 'Короткое описание новости, которое будет видно на карточке.',
		date: '2026-01-09',
		content: ['Это полный текст новости (абзац 1).', 'Это полный текст новости (абзац 2).'],
	},

	{
		slug: 'ffffffxxxxgggggggggggg',
		title: 'Первая новость SkeletonHub',
		excerpt: 'Короткое описание новости, которое будет видно на карточке.',
		date: '2025-02-09',
		content: ['Это полный текст новости (абзац 1).', 'Это полный текст новости (абзац 2).'],
	},

	{
		slug: 'datfetching',
		title: 'Первая новость SkeletonHub',
		excerpt: 'Короткое описание новости, которое будет видно на карточке.',
		date: '2023-02-09',
		content: ['Это полный текст новости (абзац 1).', 'Это полный текст новости (абзац 2).'],
	},
];
